01_test_cases/02_Haroun2010_Fig1/He_01/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    liquid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    gas
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
