01_test_cases/02_Haroun2010_Fig1/He_01/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
    volScalarFieldValue C 1.0
);

regions
(
    boxToCell
    {
        box (0 -1 -1) (0.05 0.5 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue C 0.5
        );
    }
);


// ************************************************************************* //
